## Sathish's Notebook

## Pandas

Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more

In [1]:
import numpy as np
import  pandas as pd

## Series

In [2]:
q = pd.Series([1, 3, 5, np.nan, 6, 8])
q

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
r = pd.Series([1,2,3,4,5,6], index=pd.date_range("20220101",periods=6))
r  # Setting a new column align the data by the index

2022-01-01    1
2022-01-02    2
2022-01-03    3
2022-01-04    4
2022-01-05    5
2022-01-06    6
Freq: D, dtype: int64

## Dataframe

Creating a dataframe

In [4]:
w = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame([['Alice', 19, "F", "Student"],
                     ['John', 26, 'M', 'Student']],
     columns=w)
user1

    name  age gender      job
0  Alice   19      F  Student
1   John   26      M  Student

In [5]:
user2=pd.DataFrame([['Eric', 22, 'M', "Student"],
                   ['Paul', 58, "F", "Manager"]],
    columns=w)
user2

   name  age gender      job
0  Eric   22      M  Student
1  Paul   58      F  Manager

In [6]:
user3 = pd.DataFrame(dict(name=['Peter', 'Julie'],
                     age=[33, 34],
                     gender=['M', 'F'],
                     job=['Engineer', 'Scientist']))
user3

    name  age gender        job
0  Peter   33      M   Engineer
1  Julie   34      F  Scientist

In [7]:
dates = pd.date_range("20220101",periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.rand(6,4), index=dates)
df

                   0         1         2         3
2022-01-01  0.215721  0.035809  0.076336  0.156711
2022-01-02  0.200249  0.009719  0.957670  0.384994
2022-01-03  0.131250  0.152484  0.117278  0.903410
2022-01-04  0.695960  0.792445  0.021191  0.115319
2022-01-05  0.923513  0.308096  0.948345  0.026269
2022-01-06  0.854688  0.458217  0.031283  0.034387

#or

In [9]:
df = pd.DataFrame(np.random.rand(6,4), index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2022-01-01  0.905827  0.778762  0.650708  0.102571
2022-01-02  0.228706  0.229945  0.927872  0.353492
2022-01-03  0.468460  0.547072  0.466004  0.084204
2022-01-04  0.189206  0.784716  0.534073  0.557426
2022-01-05  0.949119  0.796212  0.265303  0.633747
2022-01-06  0.023191  0.815418  0.797373  0.746337

In [10]:
df1 = pd.DataFrame({"A": 1.0,
        "B": pd.Timestamp("20220101"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"})
df1 #Timestamp is the pandasequivalent of python's Datetime

     A          B    C  D      E    F
0  1.0 2022-01-01  1.0  3   test  foo
1  1.0 2022-01-01  1.0  3  train  foo
2  1.0 2022-01-01  1.0  3   test  foo
3  1.0 2022-01-01  1.0  3  train  foo

## data type

In [11]:
df1.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Index and columns

In [12]:
df.index  #display the index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns #Display the columns.

Index(['A', 'B', 'C', 'D'], dtype='object')

## 2.Viewing data

In [14]:
long_series = pd.Series(np.random.randn(1000))

In [15]:
long_series.head() #shows first 5 values

0   -0.752594
1   -0.853895
2    0.897930
3    1.292203
4    2.229453
dtype: float64

In [16]:
long_series.tail(3) #shows last 3 values

997    0.087657
998   -0.261849
999    0.843836
dtype: float64

In [17]:
#long_series.columns gives error. Series doent have columns
long_series.index

RangeIndex(start=0, stop=1000, step=1)

## to numpy

NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column

In [18]:
df2 = pd.DataFrame(np.random.rand(6,4), index=dates,columns=list('ABCD'))
df2

                   A         B         C         D
2022-01-01  0.005301  0.186672  0.170744  0.047223
2022-01-02  0.284943  0.151306  0.403209  0.536701
2022-01-03  0.121116  0.977495  0.332844  0.232400
2022-01-04  0.717496  0.073128  0.470239  0.902057
2022-01-05  0.558121  0.158300  0.679429  0.850486
2022-01-06  0.136126  0.829397  0.152511  0.606127

In [19]:
df2.to_numpy() #it doesnt inlude the index or column labels

array([[0.005301  , 0.18667247, 0.17074412, 0.04722294],
       [0.28494323, 0.15130577, 0.40320893, 0.5367015 ],
       [0.1211156 , 0.97749485, 0.3328436 , 0.23239955],
       [0.71749591, 0.07312763, 0.47023901, 0.90205709],
       [0.55812056, 0.15830002, 0.67942878, 0.85048647],
       [0.13612565, 0.82939727, 0.15251091, 0.60612672]])

## describe

In [20]:
df2.describe() #shows a quick statistic summary of data

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.303850  0.396050  0.368163  0.529166
std    0.278125  0.397595  0.197617  0.337228
min    0.005301  0.073128  0.152511  0.047223
25%    0.124868  0.153054  0.211269  0.308475
50%    0.210534  0.172486  0.368026  0.571414
75%    0.489826  0.668716  0.453481  0.789397
max    0.717496  0.977495  0.679429  0.902057

## Transpose

In [21]:
df2.T

   2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
A    0.005301    0.284943    0.121116    0.717496    0.558121    0.136126
B    0.186672    0.151306    0.977495    0.073128    0.158300    0.829397
C    0.170744    0.403209    0.332844    0.470239    0.679429    0.152511
D    0.047223    0.536701    0.232400    0.902057    0.850486    0.606127

## sort index

In [22]:
df2.sort_index(axis=1, ascending=False)  #sort index of columns

                   D         C         B         A
2022-01-01  0.047223  0.170744  0.186672  0.005301
2022-01-02  0.536701  0.403209  0.151306  0.284943
2022-01-03  0.232400  0.332844  0.977495  0.121116
2022-01-04  0.902057  0.470239  0.073128  0.717496
2022-01-05  0.850486  0.679429  0.158300  0.558121
2022-01-06  0.606127  0.152511  0.829397  0.136126

## Sort values

In [23]:
df2.sort_values(by="B")

                   A         B         C         D
2022-01-04  0.717496  0.073128  0.470239  0.902057
2022-01-02  0.284943  0.151306  0.403209  0.536701
2022-01-05  0.558121  0.158300  0.679429  0.850486
2022-01-01  0.005301  0.186672  0.170744  0.047223
2022-01-06  0.136126  0.829397  0.152511  0.606127
2022-01-03  0.121116  0.977495  0.332844  0.232400



## 3.Selection

In [24]:
df2["A"] #select column A

2022-01-01    0.005301
2022-01-02    0.284943
2022-01-03    0.121116
2022-01-04    0.717496
2022-01-05    0.558121
2022-01-06    0.136126
Freq: D, Name: A, dtype: float64

In [25]:
df2[0:3] #slice the rows

                   A         B         C         D
2022-01-01  0.005301  0.186672  0.170744  0.047223
2022-01-02  0.284943  0.151306  0.403209  0.536701
2022-01-03  0.121116  0.977495  0.332844  0.232400

or

In [26]:
df2["20220101":"20220103"]

                   A         B         C         D
2022-01-01  0.005301  0.186672  0.170744  0.047223
2022-01-02  0.284943  0.151306  0.403209  0.536701
2022-01-03  0.121116  0.977495  0.332844  0.232400

## Selecting by label

In [27]:
df2.loc[dates[0]] #fetches first row

A    0.005301
B    0.186672
C    0.170744
D    0.047223
Name: 2022-01-01 00:00:00, dtype: float64

In [28]:
df2.loc[:,["A", "B"]]

                   A         B
2022-01-01  0.005301  0.186672
2022-01-02  0.284943  0.151306
2022-01-03  0.121116  0.977495
2022-01-04  0.717496  0.073128
2022-01-05  0.558121  0.158300
2022-01-06  0.136126  0.829397

In [29]:
df2.loc["20220102":"20220104","A":"C"]

                   A         B         C
2022-01-02  0.284943  0.151306  0.403209
2022-01-03  0.121116  0.977495  0.332844
2022-01-04  0.717496  0.073128  0.470239

In [30]:
df2.loc["20220102","A":"C"]  # reducing the dimension of the retuned  object

A    0.284943
B    0.151306
C    0.403209
Name: 2022-01-02 00:00:00, dtype: float64

In [31]:
df2.loc[dates[0],"A"]

0.005300995939561459

or

In [32]:
df2.at[dates[0], "A"]

0.005300995939561459

In [33]:
df2[pd.array([True, False, True, False, pd.NA, False], dtype="boolean")
]
#prints true value rows. here na is considered as false

                   A         B         C         D
2022-01-01  0.005301  0.186672  0.170744  0.047223
2022-01-03  0.121116  0.977495  0.332844  0.232400

## Selection by position

In [34]:
df2.iloc[3]

A    0.717496
B    0.073128
C    0.470239
D    0.902057
Name: 2022-01-04 00:00:00, dtype: float64

In [35]:
df.iloc[0:3,2:5]

                   C         D
2022-01-01  0.650708  0.102571
2022-01-02  0.927872  0.353492
2022-01-03  0.466004  0.084204

In [36]:
df2.iloc[[1,2,4],[0,3]] #returns 1,0 2,0 4,0 ...

                   A         D
2022-01-02  0.284943  0.536701
2022-01-03  0.121116  0.232400
2022-01-05  0.558121  0.850486

In [37]:
df2.iloc[:,1:3] #fetch columns

                   B         C
2022-01-01  0.186672  0.170744
2022-01-02  0.151306  0.403209
2022-01-03  0.977495  0.332844
2022-01-04  0.073128  0.470239
2022-01-05  0.158300  0.679429
2022-01-06  0.829397  0.152511

In [38]:
df2.iloc[2,3] #fetch specific values

0.23239954617043512

## Boolean indexing

In [39]:
df2[df2["A"]>0.4]

                   A         B         C         D
2022-01-04  0.717496  0.073128  0.470239  0.902057
2022-01-05  0.558121  0.158300  0.679429  0.850486

In [40]:
df2[df2>0.5] # returns values which are greater than 0.5

                   A         B         C         D
2022-01-01       NaN       NaN       NaN       NaN
2022-01-02       NaN       NaN       NaN  0.536701
2022-01-03       NaN  0.977495       NaN       NaN
2022-01-04  0.717496       NaN       NaN  0.902057
2022-01-05  0.558121       NaN  0.679429  0.850486
2022-01-06       NaN  0.829397       NaN  0.606127

In [41]:
df2.iloc[2]>0.5

A    False
B     True
C    False
D    False
Name: 2022-01-03 00:00:00, dtype: bool

In [42]:
df2.loc[:,df2.iloc[2]>0.5] #prints the true value columns

                   B
2022-01-01  0.186672
2022-01-02  0.151306
2022-01-03  0.977495
2022-01-04  0.073128
2022-01-05  0.158300
2022-01-06  0.829397

## Using isin

In [43]:
df3 = df2.copy()
df3["E"]=['one', 'two', 'three', 'four', 'two', 'five']
df3

                   A         B         C         D      E
2022-01-01  0.005301  0.186672  0.170744  0.047223    one
2022-01-02  0.284943  0.151306  0.403209  0.536701    two
2022-01-03  0.121116  0.977495  0.332844  0.232400  three
2022-01-04  0.717496  0.073128  0.470239  0.902057   four
2022-01-05  0.558121  0.158300  0.679429  0.850486    two
2022-01-06  0.136126  0.829397  0.152511  0.606127   five

In [44]:
df3[df3["E"].isin(["one", "two"])]

                   A         B         C         D    E
2022-01-01  0.005301  0.186672  0.170744  0.047223  one
2022-01-02  0.284943  0.151306  0.403209  0.536701  two
2022-01-05  0.558121  0.158300  0.679429  0.850486  two

## Setting values

In [45]:
df3.at[dates[0],"A"] = 0 #setting values by label
df3.iat[0,2] = 0  #setting values by position
df3

                   A         B         C         D      E
2022-01-01  0.000000  0.186672  0.000000  0.047223    one
2022-01-02  0.284943  0.151306  0.403209  0.536701    two
2022-01-03  0.121116  0.977495  0.332844  0.232400  three
2022-01-04  0.717496  0.073128  0.470239  0.902057   four
2022-01-05  0.558121  0.158300  0.679429  0.850486    two
2022-01-06  0.136126  0.829397  0.152511  0.606127   five

In [46]:
df3.loc[:,"D"] = np.array([5]*len(df3))
df3

                   A         B         C  D      E
2022-01-01  0.000000  0.186672  0.000000  5    one
2022-01-02  0.284943  0.151306  0.403209  5    two
2022-01-03  0.121116  0.977495  0.332844  5  three
2022-01-04  0.717496  0.073128  0.470239  5   four
2022-01-05  0.558121  0.158300  0.679429  5    two
2022-01-06  0.136126  0.829397  0.152511  5   five

In [47]:
df2[df2>0]=df2 + 2
df2

                   A         B         C         D
2022-01-01  2.005301  2.186672  2.170744  2.047223
2022-01-02  2.284943  2.151306  2.403209  2.536701
2022-01-03  2.121116  2.977495  2.332844  2.232400
2022-01-04  2.717496  2.073128  2.470239  2.902057
2022-01-05  2.558121  2.158300  2.679429  2.850486
2022-01-06  2.136126  2.829397  2.152511  2.606127

## Missing data

## reindex

In [48]:
df4 = df2.reindex(index=dates[0:5],columns=list(df2.columns)+['E'])
df4 #reindex allows to change/add/delete the index on the specified ax

                   A         B         C         D   E
2022-01-01  2.005301  2.186672  2.170744  2.047223 NaN
2022-01-02  2.284943  2.151306  2.403209  2.536701 NaN
2022-01-03  2.121116  2.977495  2.332844  2.232400 NaN
2022-01-04  2.717496  2.073128  2.470239  2.902057 NaN
2022-01-05  2.558121  2.158300  2.679429  2.850486 NaN

In [49]:
df4.loc[dates[0]:dates[1], "E"] = 1
df4

                   A         B         C         D    E
2022-01-01  2.005301  2.186672  2.170744  2.047223  1.0
2022-01-02  2.284943  2.151306  2.403209  2.536701  1.0
2022-01-03  2.121116  2.977495  2.332844  2.232400  NaN
2022-01-04  2.717496  2.073128  2.470239  2.902057  NaN
2022-01-05  2.558121  2.158300  2.679429  2.850486  NaN

notna and isna

In [50]:
pd.isna(df4["E"]) # gives true for null values

2022-01-01    False
2022-01-02    False
2022-01-03     True
2022-01-04     True
2022-01-05     True
Freq: D, Name: E, dtype: bool

In [51]:
pd.notna(df4["E"]) #gives false for null values

2022-01-01     True
2022-01-02     True
2022-01-03    False
2022-01-04    False
2022-01-05    False
Freq: D, Name: E, dtype: bool

In [52]:
df4.isna()

                A      B      C      D      E
2022-01-01  False  False  False  False  False
2022-01-02  False  False  False  False  False
2022-01-03  False  False  False  False   True
2022-01-04  False  False  False  False   True
2022-01-05  False  False  False  False   True

In [53]:
df4.isna().sum()

A    0
B    0
C    0
D    0
E    3
dtype: int64

In [54]:
df4.dropna(how="any") #drops those rows which has null values

                   A         B         C         D    E
2022-01-01  2.005301  2.186672  2.170744  2.047223  1.0
2022-01-02  2.284943  2.151306  2.403209  2.536701  1.0

In [55]:
df4.dropna(axis=1) #removes columns with 0

                   A         B         C         D
2022-01-01  2.005301  2.186672  2.170744  2.047223
2022-01-02  2.284943  2.151306  2.403209  2.536701
2022-01-03  2.121116  2.977495  2.332844  2.232400
2022-01-04  2.717496  2.073128  2.470239  2.902057
2022-01-05  2.558121  2.158300  2.679429  2.850486

In [56]:
df4.fillna(2)

                   A         B         C         D    E
2022-01-01  2.005301  2.186672  2.170744  2.047223  1.0
2022-01-02  2.284943  2.151306  2.403209  2.536701  1.0
2022-01-03  2.121116  2.977495  2.332844  2.232400  2.0
2022-01-04  2.717496  2.073128  2.470239  2.902057  2.0
2022-01-05  2.558121  2.158300  2.679429  2.850486  2.0

## operations

## stats

In [57]:
df2

                   A         B         C         D
2022-01-01  2.005301  2.186672  2.170744  2.047223
2022-01-02  2.284943  2.151306  2.403209  2.536701
2022-01-03  2.121116  2.977495  2.332844  2.232400
2022-01-04  2.717496  2.073128  2.470239  2.902057
2022-01-05  2.558121  2.158300  2.679429  2.850486
2022-01-06  2.136126  2.829397  2.152511  2.606127

In [58]:
df2.mean() #adds horizontally

A    2.303850
B    2.396050
C    2.368163
D    2.529166
dtype: float64

In [59]:
df2.mean(axis=1) #adds vertically

2022-01-01    2.102485
2022-01-02    2.344040
2022-01-03    2.415963
2022-01-04    2.540730
2022-01-05    2.561584
2022-01-06    2.431040
Freq: D, dtype: float64

In [60]:
sa = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
sa

2022-01-01    1.0
2022-01-02    3.0
2022-01-03    5.0
2022-01-04    NaN
2022-01-05    6.0
2022-01-06    8.0
Freq: D, dtype: float64

In [61]:
sa1 = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(-1)
sa1  #shifts entire value below or above

2022-01-01    3.0
2022-01-02    5.0
2022-01-03    NaN
2022-01-04    6.0
2022-01-05    8.0
2022-01-06    NaN
Freq: D, dtype: float64

In [62]:
sa2 = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(-2)
sa2

2022-01-01    5.0
2022-01-02    NaN
2022-01-03    6.0
2022-01-04    8.0
2022-01-05    NaN
2022-01-06    NaN
Freq: D, dtype: float64

In [63]:
df2.sub(sa, axis="index") #sub substracts the values

                   A         B         C         D
2022-01-01  1.005301  1.186672  1.170744  1.047223
2022-01-02 -0.715057 -0.848694 -0.596791 -0.463299
2022-01-03 -2.878884 -2.022505 -2.667156 -2.767600
2022-01-04       NaN       NaN       NaN       NaN
2022-01-05 -3.441879 -3.841700 -3.320571 -3.149514
2022-01-06 -5.863874 -5.170603 -5.847489 -5.393873

In [64]:
df6 = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
df6

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [65]:
df6.sub([2,4],axis='columns')

           angles  degrees
circle         -2      356
triangle        1      176
rectangle       2      356

In [66]:
df6.mul(10) #multiply

           angles  degrees
circle          0     3600
triangle       30     1800
rectangle      40     3600

In [67]:
df6.mul([2,4],axis = 'columns')

           angles  degrees
circle          0     1440
triangle        6      720
rectangle       8     1440

In [68]:
df6.div(10) #division

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [69]:
df6.div([2,4],axis="columns") #division

           angles  degrees
circle        0.0     90.0
triangle      1.5     45.0
rectangle     2.0     90.0

In [70]:
div, rem = divmod(df6,7)
div #gives division values

           angles  degrees
circle          0       51
triangle        0       25
rectangle       0       51

In [71]:
rem #gives remainder

           angles  degrees
circle          0        3
triangle        3        5
rectangle       4        3

In [72]:
df2+df4 # add`

                   A         B         C         D   E
2022-01-01  4.010602  4.373345  4.341488  4.094446 NaN
2022-01-02  4.569886  4.302612  4.806418  5.073403 NaN
2022-01-03  4.242231  5.954990  4.665687  4.464799 NaN
2022-01-04  5.434992  4.146255  4.940478  5.804114 NaN
2022-01-05  5.116241  4.316600  5.358858  5.700973 NaN
2022-01-06       NaN       NaN       NaN       NaN NaN

In [73]:
df2.add(df4, fill_value=None)

                   A         B         C         D   E
2022-01-01  4.010602  4.373345  4.341488  4.094446 NaN
2022-01-02  4.569886  4.302612  4.806418  5.073403 NaN
2022-01-03  4.242231  5.954990  4.665687  4.464799 NaN
2022-01-04  5.434992  4.146255  4.940478  5.804114 NaN
2022-01-05  5.116241  4.316600  5.358858  5.700973 NaN
2022-01-06       NaN       NaN       NaN       NaN NaN

## apply

In [74]:
df2

                   A         B         C         D
2022-01-01  2.005301  2.186672  2.170744  2.047223
2022-01-02  2.284943  2.151306  2.403209  2.536701
2022-01-03  2.121116  2.977495  2.332844  2.232400
2022-01-04  2.717496  2.073128  2.470239  2.902057
2022-01-05  2.558121  2.158300  2.679429  2.850486
2022-01-06  2.136126  2.829397  2.152511  2.606127

In [75]:
df2.apply(np.cumsum) #Apply a function along an axis of the DataFrame

                    A          B          C          D
2022-01-01   2.005301   2.186672   2.170744   2.047223
2022-01-02   4.290244   4.337978   4.573953   4.583924
2022-01-03   6.411360   7.315473   6.906797   6.816324
2022-01-04   9.128856   9.388601   9.377036   9.718381
2022-01-05  11.686976  11.546901  12.056464  12.568868
2022-01-06  13.823102  14.376298  14.208975  15.174994

In [76]:
df2.apply(np.sqrt)

                   A         B         C         D
2022-01-01  1.416087  1.478740  1.473345  1.430812
2022-01-02  1.511603  1.466733  1.550229  1.592703
2022-01-03  1.456405  1.725542  1.527365  1.494122
2022-01-04  1.648483  1.439836  1.571699  1.703543
2022-01-05  1.599413  1.469115  1.636896  1.688338
2022-01-06  1.461549  1.682081  1.467144  1.614350

In [77]:
df2.apply(np.sum, axis=0)

A    13.823102
B    14.376298
C    14.208975
D    15.174994
dtype: float64

In [78]:
df2.apply(np.sum, axis=1)

2022-01-01     8.409941
2022-01-02     9.376159
2022-01-03     9.663854
2022-01-04    10.162920
2022-01-05    10.246336
2022-01-06     9.724161
Freq: D, dtype: float64

## Apply and lambda

In [79]:
df6

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [80]:
df6.apply(lambda x: x+5) #add 5 to every values

           angles  degrees
circle          5      365
triangle        8      185
rectangle       9      365

In [81]:
df6.apply(lambda x: x+5 if x.name in['triangle'] else x-x, axis=1)

           angles  degrees
circle          0        0
triangle        8      185
rectangle       0        0

In [82]:
df6.apply(lambda x: [1,2], axis=1)

circle       [1, 2]
triangle     [1, 2]
rectangle    [1, 2]
dtype: object

In [83]:
df6.apply(lambda x: [1, 2], axis=1, result_type='expand')

           0  1
circle     1  2
triangle   1  2
rectangle  1  2

In [84]:
df6.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

           foo  bar
circle       1    2
triangle     1    2
rectangle    1    2

In [85]:
df6.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

           angles  degrees
circle          1        2
triangle        1        2
rectangle       1        2

## Merge

## concat

In [86]:
ddf1 = pd.DataFrame({"A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"]},
    index=[0, 1, 2, 3])
ddf1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [87]:
ddf2 = pd.DataFrame({"A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"]},
    index=[4, 5, 6, 7])
ddf2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [88]:
ddf3 = pd.DataFrame({"A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"]},
    index=[8, 9, 10, 11])
ddf3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [89]:
pd.concat([ddf1,ddf2,ddf3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [90]:
pd.concat([ddf1,ddf2,ddf3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [91]:
pd.concat([ddf1,ddf2,ddf3],keys=["x","y","z"]) #adds keys to dataset so that we can fetch using loc

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [92]:
pd.concat([ddf1,ddf2,ddf3],keys=["x","y","z"]).loc["y"]

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
ddf4 = pd.DataFrame({"B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"]},
    index=[2, 3, 6, 7])
ddf4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [94]:
pd.concat([ddf1,ddf4],axis=1) #default join is outer and it is union of rows

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [95]:
pd.concat([ddf1, ddf4], axis=1, join="inner") #intersection of rows

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [96]:
pd.concat([ddf1, ddf4], axis=1, join="outer") #inter

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [97]:
pd.concat([df1, df4], axis=1).reindex(df1.index) #reindexing

     A          B    C    D      E    F   A   B   C   D   E
0  1.0 2022-01-01  1.0  3.0   test  foo NaN NaN NaN NaN NaN
1  1.0 2022-01-01  1.0  3.0  train  foo NaN NaN NaN NaN NaN
2  1.0 2022-01-01  1.0  3.0   test  foo NaN NaN NaN NaN NaN
3  1.0 2022-01-01  1.0  3.0  train  foo NaN NaN NaN NaN NaN

In [98]:
#For DataFrame which dont have a meaningful index, you may append them and ignore that they may have overlapping indexes.
pd.concat([ddf1, ddf4],ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

## Merge`

In [99]:
left = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"]})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [100]:
right = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"]})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [101]:
pd.merge(left, right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [102]:
left1 = pd.DataFrame({"key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"]})
left1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [103]:
right1 = pd.DataFrame({"key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"]})
right1

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [104]:
pd.merge(left1,right1, on=["key1", "key2"]) #how = inner by default.Its intersection of keys from both frames

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [105]:
pd.merge(left1, right1, how="left", on=["key1", "key2"]) #Use keys from left frame only

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [106]:
pd.merge(left1, right1, how="right", on=["key1", "key2"]) #Use keys from right frame only

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [107]:
pd.merge(left1, right1, how="outer") #Use union of keys from both frames

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [108]:
pd.merge(left1, right1, how="cross") #Create the cartesian product of rows of both frames

   key1_x key2_x   A   B key1_y key2_y   C   D
0      K0     K0  A0  B0     K0     K0  C0  D0
1      K0     K0  A0  B0     K1     K0  C1  D1
2      K0     K0  A0  B0     K1     K0  C2  D2
3      K0     K0  A0  B0     K2     K0  C3  D3
4      K0     K1  A1  B1     K0     K0  C0  D0
5      K0     K1  A1  B1     K1     K0  C1  D1
6      K0     K1  A1  B1     K1     K0  C2  D2
7      K0     K1  A1  B1     K2     K0  C3  D3
8      K1     K0  A2  B2     K0     K0  C0  D0
9      K1     K0  A2  B2     K1     K0  C1  D1
10     K1     K0  A2  B2     K1     K0  C2  D2
11     K1     K0  A2  B2     K2     K0  C3  D3
12     K2     K1  A3  B3     K0     K0  C0  D0
13     K2     K1  A3  B3     K1     K0  C1  D1
14     K2     K1  A3  B3     K1     K0  C2  D2
15     K2     K1  A3  B3     K2     K0  C3  D3

## Group by

In [109]:
dff = pd.DataFrame({"A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
                   "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
                    "C": np.random.randn(8),
                    "D": np.random.randn(8),})
dff

     A      B         C         D
0  foo    one  1.505813 -0.097938
1  bar    one -2.001525  0.800481
2  foo    two -0.074422  0.856711
3  bar  three -0.393577 -0.700048
4  foo    two  2.538711 -0.653148
5  bar    two  1.165438  1.692419
6  foo    one  0.651698  0.007186
7  foo  three -1.626381 -0.440982

In [110]:
dff.groupby("A").sum() #group the values in A and sum the values

            C         D
A
bar -1.229664  1.792852
foo  2.995419 -0.328171

In [111]:
dff.groupby(["A","B"]).sum()

                  C         D
A   B
bar one   -2.001525  0.800481
    three -0.393577 -0.700048
    two    1.165438  1.692419
foo one    2.157511 -0.090752
    three -1.626381 -0.440982
    two    2.464289  0.203563

In [112]:
dff.groupby(["A","B"], sort=False).sum() #will not sort index

                  C         D
A   B
foo one    2.157511 -0.090752
bar one   -2.001525  0.800481
foo two    2.464289  0.203563
bar three -0.393577 -0.700048
    two    1.165438  1.692419
foo three -1.626381 -0.440982

In [113]:
dff.groupby(["A"]).get_group("foo") #gropus the specific values of the columns

     A      B         C         D
0  foo    one  1.505813 -0.097938
2  foo    two -0.074422  0.856711
4  foo    two  2.538711 -0.653148
6  foo    one  0.651698  0.007186
7  foo  three -1.626381 -0.440982

In [114]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

df_dropna = pd.DataFrame(df_list, columns=["a", "b", "c"])

df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [115]:
df_dropna.groupby(by=["b"],dropna=True).sum() #dropna is set to be true

     a  c
b
1.0  2  3
2.0  2  5

In [116]:
df_dropna.groupby(by=["b"],dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

## Multiindex

In [117]:
arrays = [["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
          ["one", "two", "one", "two", "one", "two", "one", "two"],]
tuples = list(zip(*arrays))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [118]:
yy = pd.MultiIndex.from_tuples(tuples,name=["First","Third"])
yy

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['First', 'Third'])

In [119]:
uu = pd.Series(np.random.rand(8),index=yy)  
uu  #Multiple index in series

First  Third
bar    one      0.839540
       two      0.439037
baz    one      0.621419
       two      0.056711
foo    one      0.940151
       two      0.748024
qux    one      0.653299
       two      0.298995
dtype: float64

In [120]:
pd.DataFrame(uu,columns=["Numbers"])

              Numbers
First Third
bar   one    0.839540
      two    0.439037
baz   one    0.621419
      two    0.056711
foo   one    0.940151
      two    0.748024
qux   one    0.653299
      two    0.298995

In [121]:
tuples1 = list(zip(*[["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
         ["one", "two", "one", "two", "one", "two", "one", "two"]]))
tuples1

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [122]:
tt = pd.MultiIndex.from_tuples(tuples1,names=["first","Second"])

In [123]:
dff1 = pd.DataFrame(np.random.rand(8,2),index=tt,columns=["A", "B"])
dff1

                     A         B
first Second
bar   one     0.604142  0.772754
      two     0.241536  0.251013
baz   one     0.427140  0.713829
      two     0.974196  0.697553
foo   one     0.951711  0.450686
      two     0.194044  0.205638
qux   one     0.788253  0.239274
      two     0.503184  0.156894

## Stack

In [124]:
stacked = dff1.stack()  # compress a level in the Dataframes columns
stacked

first  Second
bar    one     A    0.604142
               B    0.772754
       two     A    0.241536
               B    0.251013
baz    one     A    0.427140
               B    0.713829
       two     A    0.974196
               B    0.697553
foo    one     A    0.951711
               B    0.450686
       two     A    0.194044
               B    0.205638
qux    one     A    0.788253
               B    0.239274
       two     A    0.503184
               B    0.156894
dtype: float64

In [125]:
stacked.unstack() #reverses the stack

                     A         B
first Second
bar   one     0.604142  0.772754
      two     0.241536  0.251013
baz   one     0.427140  0.713829
      two     0.974196  0.697553
foo   one     0.951711  0.450686
      two     0.194044  0.205638
qux   one     0.788253  0.239274
      two     0.503184  0.156894

In [126]:
stacked.unstack(0) #first index will become a column

first          bar       baz       foo       qux
Second
one    A  0.604142  0.427140  0.951711  0.788253
       B  0.772754  0.713829  0.450686  0.239274
two    A  0.241536  0.974196  0.194044  0.503184
       B  0.251013  0.697553  0.205638  0.156894

In [127]:
stacked.unstack(1) #2nd will become column

Second        one       two
first
bar   A  0.604142  0.241536
      B  0.772754  0.251013
baz   A  0.427140  0.974196
      B  0.713829  0.697553
foo   A  0.951711  0.194044
      B  0.450686  0.205638
qux   A  0.788253  0.503184
      B  0.239274  0.156894

In [128]:
stacked.unstack(2) #third will become a column

                     A         B
first Second
bar   one     0.604142  0.772754
      two     0.241536  0.251013
baz   one     0.427140  0.713829
      two     0.974196  0.697553
foo   one     0.951711  0.450686
      two     0.194044  0.205638
qux   one     0.788253  0.239274
      two     0.503184  0.156894

## Pivot Tables

In [129]:
import datetime

In [130]:
dfg = pd.DataFrame({"A":["one","one","two", "three"]*6,
                    "B": ["A", "B", "C"] * 8,
                    "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 4,
                    "D": np.random.randn(24),
                   "E": np.random.randn(24),
                   "F": [datetime.datetime(2022,i,1) for i in range(1,13)]+
                   [datetime.datetime(2022,i,15) for i in range (1,13)]})
dfg

        A  B    C         D         E          F
0     one  A  foo -0.786962 -0.126071 2022-01-01
1     one  B  foo -0.465323  0.323880 2022-02-01
2     two  C  foo -0.080806  0.103513 2022-03-01
3   three  A  bar  0.902314  1.350192 2022-04-01
4     one  B  bar -0.417858 -0.078108 2022-05-01
5     one  C  bar  1.614809  0.426803 2022-06-01
6     two  A  foo -0.642650  0.406831 2022-07-01
7   three  B  foo  0.418597 -0.305887 2022-08-01
8     one  C  foo  0.108789  1.232956 2022-09-01
9     one  A  bar -0.888250  1.037341 2022-10-01
10    two  B  bar -1.254798  0.858187 2022-11-01
11  three  C  bar  1.008025  0.535008 2022-12-01
12    one  A  foo  0.168385 -0.710340 2022-01-15
13    one  B  foo  0.899575 -1.940437 2022-02-15
14    two  C  foo -0.303600 -1.155800 2022-03-15
15  three  A  bar -0.421059 -0.605280 2022-04-15
16    one  B  bar -1.114949  1.936010 2022-05-15
17    one  C  bar -0.584039 -1.096655 2022-06-15
18    two  A  foo  0.527503 -0.040126 2022-07-15
19  three  B  foo -0.833901  1.097948 2022-08-15
20    one  C  foo -0.199736  1.169162 2022-09-15
21    one  A  bar  0.159375  0.541520 2022-10-15
22    two  B  bar  0.743284  1.789811 2022-11-15
23  three  C  bar -2.715734  1.446770 2022-12-15

In [131]:
pd.pivot_table(dfg,
               values="D",
               index=["A", "B"],
               columns=["C"])
# creates pivot table
#values: a column or a list of columns to aggregate
#aggfunc: function to use for aggregation, defaulting to numpy.mean

C             bar       foo
A     B
one   A -0.364437 -0.309289
      B -0.766403  0.217126
      C  0.515385 -0.045474
three A  0.240628       NaN
      B       NaN -0.207652
      C -0.853855       NaN
two   A       NaN -0.057573
      B -0.255757       NaN
      C       NaN -0.192203

In [132]:
pd.pivot_table(dfg,
               values="D",
               index ="B",
               columns=["A","C"],
               aggfunc=np.sum)

A       one               three                 two
C       bar       foo       bar       foo       bar       foo
B
A -0.728875 -0.618578  0.481255       NaN       NaN -0.115147
B -1.532806  0.434252       NaN -0.415304 -0.511514       NaN
C  1.030770 -0.090947 -1.707709       NaN       NaN -0.384406

In [133]:
pd.pivot_table(dfg,
              values=["D", "E"],
              index=["B"],
              columns=["A","C"],
              aggfunc=np.sum)

          D                                                           E  \
A       one               three                 two                 one
C       bar       foo       bar       foo       bar       foo       bar
B
A -0.728875 -0.618578  0.481255       NaN       NaN -0.115147  1.578861
B -1.532806  0.434252       NaN -0.415304 -0.511514       NaN  1.857902
C  1.030770 -0.090947 -1.707709       NaN       NaN -0.384406 -0.669852


A               three                two
C       foo       bar      foo       bar       foo
B
A -0.836411  0.744912      NaN       NaN  0.366705
B -1.616557       NaN  0.79206  2.647998       NaN
C  2.402118  1.981778      NaN       NaN -1.052287

In [134]:
pd.pivot_table(dfg,
              index=["A", "B"],
              columns=["C"])
#if values not given then it will include all of the data that can be aggregated

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.364437 -0.309289  0.789430 -0.418206
      B -0.766403  0.217126  0.928951 -0.808279
      C  0.515385 -0.045474 -0.334926  1.201059
three A  0.240628       NaN  0.372456       NaN
      B       NaN -0.207652       NaN  0.396030
      C -0.853855       NaN  0.990889       NaN
two   A       NaN -0.057573       NaN  0.183353
      B -0.255757       NaN  1.323999       NaN
      C       NaN -0.192203       NaN -0.526144

## grooper and pivot tabel

In [135]:
pd.pivot_table(dfg,
              values="D",
              index="F",
              columns="C")
#Without grooper

C                bar       foo
F
2022-01-01       NaN -0.786962
2022-01-15       NaN  0.168385
2022-02-01       NaN -0.465323
2022-02-15       NaN  0.899575
2022-03-01       NaN -0.080806
2022-03-15       NaN -0.303600
2022-04-01  0.902314       NaN
2022-04-15 -0.421059       NaN
2022-05-01 -0.417858       NaN
2022-05-15 -1.114949       NaN
2022-06-01  1.614809       NaN
2022-06-15 -0.584039       NaN
2022-07-01       NaN -0.642650
2022-07-15       NaN  0.527503
2022-08-01       NaN  0.418597
2022-08-15       NaN -0.833901
2022-09-01       NaN  0.108789
2022-09-15       NaN -0.199736
2022-10-01 -0.888250       NaN
2022-10-15  0.159375       NaN
2022-11-01 -1.254798       NaN
2022-11-15  0.743284       NaN
2022-12-01  1.008025       NaN
2022-12-15 -2.715734       NaN

In [136]:
pd.pivot_table(dfg,
              values="D",
              index=pd.Grouper(freq="M",key="F"),
              columns="C")
#grooper groups the values by month for M
#nM for n months

C                bar       foo
F
2022-01-31       NaN -0.309289
2022-02-28       NaN  0.217126
2022-03-31       NaN -0.192203
2022-04-30  0.240628       NaN
2022-05-31 -0.766403       NaN
2022-06-30  0.515385       NaN
2022-07-31       NaN -0.057573
2022-08-31       NaN -0.207652
2022-09-30       NaN -0.045474
2022-10-31 -0.364437       NaN
2022-11-30 -0.255757       NaN
2022-12-31 -0.853855       NaN

In [137]:
#To miss out the empty values
table = pd.pivot_table(dfg, index=["A", "B"], columns=["C"])
print(table.to_string(na_rep=""))

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.364437 -0.309289  0.789430 -0.418206
      B -0.766403  0.217126  0.928951 -0.808279
      C  0.515385 -0.045474 -0.334926  1.201059
three A  0.240628            0.372456
      B           -0.207652            0.396030
      C -0.853855            0.990889
two   A           -0.057573            0.183353
      B -0.255757            1.323999
      C           -0.192203           -0.526144

In [138]:
#Margin
#If you pass margins=True to pivot_table, special All columns and rows will be added
dfg1 = dfg.pivot_table(index=["A", "B"], columns="C", margins=True, aggfunc=np.std)
dfg1

                D                             E
C             bar       foo       All       bar       foo       All
A     B
one   A  0.740782  0.675533  0.579696  0.350598  0.413141  0.764197
      B  0.492918  0.965129  0.844940  1.424196  1.601113  1.592678
      C  1.554821  0.218160  0.962570  1.077247  0.045109  1.083474
three A  0.935766       NaN  0.935766  1.382728       NaN  1.382728
      B       NaN  0.885650  0.885650       NaN  0.992661  0.992661
      C  2.633096       NaN  2.633096  0.644713       NaN  0.644713
two   A       NaN  0.827423  0.827423       NaN  0.316047  0.316047
      B  1.412857       NaN  1.412857  0.658758       NaN  0.658758
      C       NaN  0.157540  0.157540       NaN  0.890469  0.890469
All      1.204389  0.545035  0.898044  0.928989  0.957758  0.964102

In [139]:
#call DataFrame.stack() to display a pivoted DataFrame as having a multi-level index:
dfg1.stack()

                    D         E
A     B C
one   A All  0.579696  0.764197
        bar  0.740782  0.350598
        foo  0.675533  0.413141
      B All  0.844940  1.592678
        bar  0.492918  1.424196
        foo  0.965129  1.601113
      C All  0.962570  1.083474
        bar  1.554821  1.077247
        foo  0.218160  0.045109
three A All  0.935766  1.382728
        bar  0.935766  1.382728
      B All  0.885650  0.992661
        foo  0.885650  0.992661
      C All  2.633096  0.644713
        bar  2.633096  0.644713
two   A All  0.827423  0.316047
        foo  0.827423  0.316047
      B All  1.412857  0.658758
        bar  1.412857  0.658758
      C All  0.157540  0.890469
        foo  0.157540  0.890469
All     All  0.898044  0.964102
        bar  1.204389  0.928989
        foo  0.545035  0.957758

## Time Series

In [140]:
dti = pd.to_datetime(["1/1/2022", np.datetime64("2022-01-10"),datetime.datetime(2022,1,15)])
dti  #datetime64 is the general numpy date type

DatetimeIndex(['2022-01-01', '2022-01-10', '2022-01-15'], dtype='datetime64[ns]', freq=None)

In [141]:
dti1 = pd.date_range("2022-01-01", periods=5, freq = "H")
dti1 
# periods is range
# freq is rate

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-01 01:00:00',
               '2022-01-01 02:00:00', '2022-01-01 03:00:00',
               '2022-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [142]:
dti2 = dti.tz_localize("UTC")
dti2 #at utc timezone

DatetimeIndex(['2022-01-01 00:00:00+00:00', '2022-01-10 00:00:00+00:00',
               '2022-01-15 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq=None)

In [143]:
dti2.tz_convert("Us/Pacific") #converting timezones

DatetimeIndex(['2021-12-31 16:00:00-08:00', '2022-01-09 16:00:00-08:00',
               '2022-01-14 16:00:00-08:00'],
              dtype='datetime64[ns, US/Pacific]', freq=None)

In [144]:
idx = pd.date_range("2022-01-01", periods=5, freq="H")
ts = pd.Series(range(len(idx)), index=idx)
ts

2022-01-01 00:00:00    0
2022-01-01 01:00:00    1
2022-01-01 02:00:00    2
2022-01-01 03:00:00    3
2022-01-01 04:00:00    4
Freq: H, dtype: int64

In [145]:
ts.resample("2H").mean() #Resampling or converting a time series to a particular frequency

2022-01-01 00:00:00    0.5
2022-01-01 02:00:00    2.5
2022-01-01 04:00:00    4.0
Freq: 2H, dtype: float64

For time series data, its conventional to represent the time component in the index of a Series or DataFrame so manipulations can be performed with respect to the time element.

In [146]:
pd.Series(range(3), index = pd.date_range("2022",freq="D",periods=3))

2022-01-01    0
2022-01-02    1
2022-01-03    2
Freq: D, dtype: int64

In [147]:
pd.Series(pd.date_range("2022",freq="D",periods=4))

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
dtype: datetime64[ns]

In [148]:
pd.Series(pd.date_range("1/1/2022",freq="M",periods=5))

0   2022-01-31
1   2022-02-28
2   2022-03-31
3   2022-04-30
4   2022-05-31
dtype: datetime64[ns]

pandas represents null date times, time deltas, and time spans as NaT

In [149]:
pd.Timestamp(pd.NaT)

NaT

In [150]:
# Timedelta represents a duration, the difference between two dates or times
pd.Timedelta(pd.NaT)

NaT

In [151]:
pd.Period(pd.NaT)

NaT

## Timestamps vs. time spans

Timestamped data is the most basic type of time series data that associates values with points in time. For pandas objects it means using the points in time.

In [152]:
pd.Timestamp(datetime.datetime(2022,5,1))
#or
#pd.Timestamp("2022,5,1")

Timestamp('2022-05-01 00:00:00')

However, in many cases it is more natural to associate things like change variables with a time span instead. The span represented by Period can be specified explicitly, or inferred from datetime string format.

In [153]:
pd.Period("2022-01")

Period('2022-01', 'M')

In [154]:
pd.Period("2022-05",freq ="D")

Period('2022-05-01', 'D')

Timestamp and Period can serve as an index. Lists of Timestamp and Period are automatically coerced to DatetimeIndex and PeriodIndex respectively.

In [155]:
dates1 = [pd.Timestamp("2022-01-02"),
        pd.Timestamp("2022-01-03"),
        pd.Timestamp("2012-01-04")]
pd.Series(np.random.randn(3),dates1)

2022-01-02   -0.287974
2022-01-03    0.614986
2012-01-04    1.577501
dtype: float64

In [156]:
periods1 = [pd.Period("2022-01"), pd.Period("2022-02"), pd.Period("2022-03")]
pd.Series(np.random.randn(3),periods1)

2022-01    1.166762
2022-02    1.216771
2022-03   -0.590438
Freq: M, dtype: float64

## to.date_time

To convert a Series or list-like object of date-like objects e.g. strings, epochs, or a mixture, you can use the to_datetime function. When passed a Series, this returns a Series (with the same index), while a list-like is converted to a DatetimeIndex:`

In [157]:
pd.to_datetime(pd.Series(["JUL 31, 2022","2022,01,10",None]))

0   2022-07-31
1   2022-10-01
2          NaT
dtype: datetime64[ns]

In [158]:
pd.to_datetime(["2022-11-13","2022/12/13"])

DatetimeIndex(['2022-11-13', '2022-12-13'], dtype='datetime64[ns]', freq=None)

 ## Categoricals

Categoricals are a pandas data type corresponding to categorical variables in statistics.Examples are gender, social class, blood type, country affiliation, observation time or rating via Likert scales.

In [160]:
pd.Series(["a","b","c"],dtype="category")

0    a
1    b
2    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

converting an existing series or column to a category type

In [166]:
dfq = pd.DataFrame({"A":["a","b","c"]})
dfq.astype("category")

   A
0  a
1  b
2  c

In [170]:
dfq1 = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]})
dfq1

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [186]:
dfq1["grade"] = dfq1["raw_grade"].astype("category")
dfq1["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

Rename the categories to more meaningful names

In [188]:
dfq1["grade"].cat.categories = ["very good", "good","bad"]
dfq1["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5          bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'bad']

Reorder the categories and simultaneously add the missing categories

In [207]:
dfq1["grade"] = dfq1["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
dfq1["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5          bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [210]:
dfq1.groupby("grade").size()

grade
very bad     0
bad          1
medium       0
good         2
very good    3
dtype: int64

In [208]:
dfq1.sort_values(by="grade")

   id raw_grade      grade
5   6         e        bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

## series.cat

Accessor object for categorical properties of the Series values

In [191]:
sq = pd.Series(list("abbccc")).astype("category")
sq

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [193]:
sq.cat.categories

Index(['a', 'b', 'c'], dtype='object')

In [195]:
sq.cat.rename_categories(list("cba"))

0    c
1    b
2    b
3    a
4    a
5    a
dtype: category
Categories (3, object): ['c', 'b', 'a']

In [196]:
sq.cat.reorder_categories(list("cba"))

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (3, object): ['c', 'b', 'a']

In [198]:
sq.cat.add_categories(["d", "e"])

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [199]:
sq.cat.remove_categories(["a", "c"])

0    NaN
1      b
2      b
3    NaN
4    NaN
5    NaN
dtype: category
Categories (1, object): ['b']

In [202]:
sq1 = sq.cat.add_categories(["d", "e"])
sq1.cat.remove_unused_categories()

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [204]:
sq.cat.set_categories(list("abcde"))

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [205]:
sq.cat.as_ordered()

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (3, object): ['a' < 'b' < 'c']

In [206]:
sq.cat.as_unordered()

0    a
1    b
2    b
3    c
4    c
5    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

## csv files

To write csv file

In [216]:
dfq1.to_csv("foo.csv")

To read csv

In [215]:
pd.read_csv("foo.csv")

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e        bad

## Excel

In [217]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

In [218]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

   Unnamed: 0  id raw_grade
0           0   1         a
1           1   2         b
2           2   3         b
3           3   4         a
4           4   5         a
5           5   6         e